#01 Importing libraries for Data Wrangling

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#import orders.csv data set
df_ords = pd.read_csv('orders.csv' , index_col= False)

In [3]:
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [4]:
#02 identifying another variable which is not neccessary in numeric calculations & turning it into a String data type.
df_ords['order_dow'] = df_ords['order_dow'].astype('str')

In [5]:
display(df_ords['order_dow'].dtype)

dtype('O')

In [6]:
#03 renaming an unintutive name of a column in the orders.csv
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'} , inplace=True)

In [8]:
display(df_ords.columns)

Index(['order_id', 'user_id', 'eval_set', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [11]:
#04 Finding the busiest hour for placing an order
hour_counts = df_ords['order_hour_of_day'].value_counts()
busiest_hour = hour_counts.idxmax()   # gives the hour (e.g. 14)

In [13]:
print('busiest hour is :' , busiest_hour, 'OClock')

busiest hour is : 10 OClock

In [14]:
# importing the second data set: products.csv
df_prods = pd.read_csv ('products.csv', index_col= False)

In [15]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [16]:
# importing the third data set: departments.csv
df_dp = pd.read_csv ('departments.csv', index_col= False)

In [17]:
display(df_dp.head())

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [18]:
#transpositing department data set from wide format to long format
df_dp_t = df_dp.T

In [19]:
# we need to adjust the data set's header after transposition. Therefore, the next 3 steps must be concluded:
# 1: make a new header
new_header = df_dp_t.iloc[0]

In [20]:
# 2 copy the rest of the data set into a new variable
df_dp_t_new = df_dp_t[1:]

In [21]:
# 3 adding the header to the columns
df_dp_t_new.columns = new_header

In [22]:
display(df_dp_t_new)

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

# tasks number 5 to 13

In [25]:
# 5: meaning behind a value of 4 in the "department_id" column within the df_prods dataframe using a data dictionary.
# first I will create  a data dictionary from departments data set
data_dict = df_dp_t_new.to_dict('index')

In [26]:
display(data_dict)

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [28]:
# let's check the top 5 rows of the products data set to adapt number 4 in it with data dictionary
df_prods.head(5)

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [27]:
# now I will adapt the number 4 in products data set with the data dictionary made from departments data set
display(data_dict.get('4'))

{'department': 'produce'}

In [31]:
# 6: breakfast subset
df_breakfast = df_prods[df_prods['department_id']== 14]

In [34]:
df_breakfast

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6
...,...,...,...,...,...
49330,49326,Cereal Variety Fun Pack,121,14,9.1
49395,49391,Light and Fluffy Buttermilk Pancake Mix,130,14,2.0
49547,49543,Chocolate Cheerios Cereal,121,14,10.8
49637,49633,Shake 'N Pour Buttermilk Pancake Mix,130,14,14.2
49667,49663,Ultra Protein Power Crunch Peanut Butter N' Ho...,57,14,10.2

In [36]:
# 7: all observations from the entire dataframe that include items from the following departments: alcohol, deli, beverages, and meat/seafood.
df_party_prods = df_prods.loc[df_prods['department_id'].isin([5,7,12,20]) ]

In [37]:
display (df_party_prods)

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1
...,...,...,...,...,...
49676,49672,Cafe Mocha K-Cup Packs,26,7,6.5
49679,49675,Cinnamon Dolce Keurig Brewed K Cups,26,7,14.0
49680,49676,Ultra Red Energy Drink,64,7,14.5
49686,49682,California Limeade,98,7,4.3
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3

In [41]:
# 8: How many rows does the last dataframe you created have?
display ( 'The Number of rows and columns are:'  , df_party_prods.shape)

'The Number of rows and columns are:'

(7650, 5)

In [42]:
# 9: Extract all the information you can about the customer with a "user_id" of “1.” 
df_customer_user1 = df_ords[df_ords['user_id']== 1]

In [43]:
display (df_customer_user1)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0
10,1187899,1,train,11,4,8,14.0

In [44]:
# 10: basic statistics about customer with user_id '1'
df_customer_user1.describe()

,order_id,user_id,order_number,order_hour_of_day,days_since_prior_order
count,1.100000e+01,11.0,11.000000,11.000000,10.000000
mean,1.923450e+06,1.0,6.000000,10.090909,19.000000
std,1.071950e+06,0.0,3.316625,3.477198,9.030811
min,4.315340e+05,1.0,1.000000,7.000000,0.000000
25%,8.690170e+05,1.0,3.500000,7.500000,14.250000
50%,2.295261e+06,1.0,6.000000,8.000000,19.500000
75%,2.544846e+06,1.0,8.500000,13.000000,26.250000
max,3.367565e+06,1.0,11.000000,16.000000,30.000000

In [45]:
print('This customer usually places orders on average at 10:00 and at the latest on 16:00.', 
      '\nIt also takes 19 days on average for an order to be placed.')

This customer usually places orders on average at 10:00 and at the latest on 16:00.
It also takes 19 days on average for an order to be placed.

In [46]:
# 12: Export df_ords dataframe as “orders_wrangled.csv
df_ords.to_csv('orders_wrangled.csv')

In [47]:
# Export the df_dp_t_new dataframe as “departments_wrangled.csv”
df_dp_t_new.to_csv('departments_wrangled.csv')